ychuang3/NUC990_linux-6.6.y/include/dt-bindings/reset/nuvoton,nuc990-reset.h
/* SPDX-License-Identifier: GPL-2.0 */
/*
 * Copyright (C) 2025 Nuvoton Technology Corp.
 *
 */

#ifndef _NUVOTON_NUC990_RESET_H_
#define _NUVOTON_NUC990_RESET_H_

#define NUC990_RESET_CHIP		0
#define NUC990_RESET_CPU		2
#define NUC990_RESET_EBI		3
#define NUC990_RESET_PDMA0		4
#define NUC990_RESET_PDMA1		5
#define NUC990_RESET_SDIC		6
#define NUC990_RESET_GPIO		7
#define NUC990_RESET_I2S		8
#define NUC990_RESET_EMAC0		16
#define NUC990_RESET_EMAC1		17
#define NUC990_RESET_USBH		18
#define NUC990_RESET_USBD		19
#define NUC990_RESET_NAND		20
#define NUC990_RESET_KS			21
#define NUC990_RESET_OTP		22
#define NUC990_RESET_CRYPTO		23
#define NUC990_RESET_SDH0		24
#define NUC990_RESET_SDH1		25
#define NUC990_RESET_CANFD0		28
#define NUC990_RESET_CANFD1		29
#define NUC990_RESET_CANFD2		30
#define NUC990_RESET_CANFD3		31

#define NUC990_RESET_AIC		36
#define NUC990_RESET_QSPI0		37
#define NUC990_RESET_WWDT		39
#define NUC990_RESET_TIMER0		40
#define NUC990_RESET_TIMER1		41
#define NUC990_RESET_TIMER2		42
#define NUC990_RESET_TIMER3		43
#define NUC990_RESET_TIMER4		44
#define NUC990_RESET_TIMER5		45
#define NUC990_RESET_UART0		48
#define NUC990_RESET_UART1		49
#define NUC990_RESET_UART2		50
#define NUC990_RESET_UART3		51
#define NUC990_RESET_UART4		52
#define NUC990_RESET_UART5		53
#define NUC990_RESET_UART6		54
#define NUC990_RESET_UART7		55
#define NUC990_RESET_UART8		56
#define NUC990_RESET_UART9		57

#define NUC990_RESET_I2C0		64
#define NUC990_RESET_I2C1		65
#define NUC990_RESET_I2C2		66
#define NUC990_RESET_I2C3		67
#define NUC990_RESET_SPI0		68
#define NUC990_RESET_SPI1		69
#define NUC990_RESET_SPI2		70
#define NUC990_RESET_SPI3		71
#define NUC990_RESET_CAN0		72
#define NUC990_RESET_CAN1		73
#define NUC990_RESET_CAN2		74
#define NUC990_RESET_CAN3		75
#define NUC990_RESET_ADC		88
#define NUC990_RESET_EADC		89
#define NUC990_RESET_BPWM0		90
#define NUC990_RESET_BPWM1		91
#define NUC990_RESET_SMC0		94
#define NUC990_RESET_SMC1		95

#define NUC990_RST_NR			96

#endif /* _NUVOTON_NUC990_RESET_H_ */